In [97]:
import numpy as np
import pandas as pd

In [98]:
student_data = {
    "Maths":[98,87,75,88,90],
    "Physics":[98,87,75,88,90],
    "Chemistry":[98,87,75,88,90],
    "PST":[98,87,75,88,90],
    "Urdu":[98,87,75,88,90],
}
student_result_table = pd.DataFrame(student_data, index=np.arange(1,len(student_data["Maths"])+1))
student_result_table

   Chemistry  Maths  PST  Physics  Urdu
1         98     98   98       98    98
2         87     87   87       87    87
3         75     75   75       75    75
4         88     88   88       88    88
5         90     90   90       90    90

In [99]:
student_result_table["Total"] = student_result_table["Chemistry"] + student_result_table["Maths"] + student_result_table["PST"] + student_result_table["Physics"] + student_result_table["Urdu"]

In [100]:
student_result_table

   Chemistry  Maths  PST  Physics  Urdu  Total
1         98     98   98       98    98    490
2         87     87   87       87    87    435
3         75     75   75       75    75    375
4         88     88   88       88    88    440
5         90     90   90       90    90    450

In [101]:
# Check each for marks below 30.
if student_result_table.columns[0] < 33:
    print("Failed")
else:
    print("Passed")

TypeError: unorderable types: str() < int()

In [102]:
student_result_table.columns

Index(['Chemistry', 'Maths', 'PST', 'Physics', 'Urdu', 'Total'], dtype='object')

In [103]:
student_result_table["Remarks"] = ["Fail" if c < 33 or m < 33 or p < 33 or ph < 33 or u < 33 else "Pass" for c, m, p, ph, u in zip(student_result_table["Chemistry"],student_result_table["Maths"],student_result_table["PST"],student_result_table["Physics"], student_result_table["Urdu"])]

In [104]:
student_result_table

   Chemistry  Maths  PST  Physics  Urdu  Total Remarks
1         98     98   98       98    98    490    Pass
2         87     87   87       87    87    435    Pass
3         75     75   75       75    75    375    Pass
4         88     88   88       88    88    440    Pass
5         90     90   90       90    90    450    Pass

In [105]:
# Column referencing.
student_result_table.Maths

1    98
2    87
3    75
4    88
5    90
Name: Maths, dtype: int64

In [106]:
# Checking column
for col in student_result_table.columns:
    if "Urdu" in col:
        print("Subject Found.")
    else:
        print("Subject not found.")

Subject not found.
Subject not found.
Subject not found.
Subject not found.
Subject Found.
Subject not found.
Subject not found.

In [107]:
# ReIndexing.
frame_reindexed = pd.DataFrame(np.arange(1,51).reshape(10,5), index=np.arange(1,11), columns=['a','b','c','d','e'])
frame_reindexed

     a   b   c   d   e
1    1   2   3   4   5
2    6   7   8   9  10
3   11  12  13  14  15
4   16  17  18  19  20
5   21  22  23  24  25
6   26  27  28  29  30
7   31  32  33  34  35
8   36  37  38  39  40
9   41  42  43  44  45
10  46  47  48  49  50

In [108]:
# Index provided does not exist.
frame_reindexed.reindex(['a','b','c','d','E'])

    a   b   c   d   e
a NaN NaN NaN NaN NaN
b NaN NaN NaN NaN NaN
c NaN NaN NaN NaN NaN
d NaN NaN NaN NaN NaN
E NaN NaN NaN NaN NaN

In [109]:
frame_reindexed.reindex(np.arange(10,101,10))

        a     b     c     d     e
10   46.0  47.0  48.0  49.0  50.0
20    NaN   NaN   NaN   NaN   NaN
30    NaN   NaN   NaN   NaN   NaN
40    NaN   NaN   NaN   NaN   NaN
50    NaN   NaN   NaN   NaN   NaN
60    NaN   NaN   NaN   NaN   NaN
70    NaN   NaN   NaN   NaN   NaN
80    NaN   NaN   NaN   NaN   NaN
90    NaN   NaN   NaN   NaN   NaN
100   NaN   NaN   NaN   NaN   NaN

In [110]:
frame_obj = frame_reindexed.drop(10)
frame_obj

    a   b   c   d   e
1   1   2   3   4   5
2   6   7   8   9  10
3  11  12  13  14  15
4  16  17  18  19  20
5  21  22  23  24  25
6  26  27  28  29  30
7  31  32  33  34  35
8  36  37  38  39  40
9  41  42  43  44  45

In [111]:
student_result_table[student_result_table["Chemistry"] > 87]

   Chemistry  Maths  PST  Physics  Urdu  Total Remarks
1         98     98   98       98    98    490    Pass
4         88     88   88       88    88    440    Pass
5         90     90   90       90    90    450    Pass

In [112]:
student_result_table[(student_result_table["Maths"] < 90) and (student_result_table["Chemistry"] < 90)]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [113]:
student_result_table[[3,2,1]]

KeyError: '[3 2 1] not in index'

In [114]:
student_result_table

   Chemistry  Maths  PST  Physics  Urdu  Total Remarks
1         98     98   98       98    98    490    Pass
2         87     87   87       87    87    435    Pass
3         75     75   75       75    75    375    Pass
4         88     88   88       88    88    440    Pass
5         90     90   90       90    90    450    Pass

In [115]:
del student_result_table["Remarks"]
my_lambda = lambda x:x.max()
student_result_table.apply(my_lambda)

Chemistry     98
Maths         98
PST           98
Physics       98
Urdu          98
Total        490
dtype: int64

In [116]:
frame = pd.DataFrame(np.arange(1,13).reshape(4,3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

         b   d   e
Utah     1   2   3
Ohio     4   5   6
Texas    7   8   9
Oregon  10  11  12

In [117]:
frame.apply(my_lambda)

b    10
d    11
e    12
dtype: int64

In [90]:
frame.apply(my_lambda, axis=1)

Utah       3
Ohio       6
Texas      9
Oregon    12
dtype: int64

In [119]:
# Apply lambda on selected column.
frame[['b','d']].apply(lambda num: num**2)

          b    d
Utah      1    4
Ohio     16   25
Texas    49   64
Oregon  100  121

In [123]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [125]:
df["A"].map(lambda num: np.square(num))

0    16
1    16
2    16
Name: A, dtype: int64

In [126]:
df.applymap(lambda num: np.square(num))

    A   B
0  16  81
1  16  81
2  16  81

In [144]:
student_result_table["Remarks"] = student_result_table["Total"].apply(lambda x:"Pass" if x > 33 else "Fail")
student_result_table

SyntaxError: invalid syntax (<ipython-input-144-d682643f906d>, line 1)